org/Husserlian_phenomenology.org
#+setupfile: ./hugo_setup.org
#+hugo_slug: Husserlian_phenomenology
#+TITLE: Husserlian phenomenology
* conceptual sketch
** subjects perceive phenomena, which they turn into noema
** noema:: concepts or mental representations of phenomena
** noesis:: phenomena --> noema
*** noesis is a function that maps phenomena to noema
** when we attempt to apply noesis to noesis recursively, we get noema again and end up resolving this with a need to presuppose the existence of a subject
*** see the reference to The Phenomenological Reduction of Science by Max Scheler in 1929
* [[file:A_brief_history_of_Western_Philosophy_by_Anthony_Kenny_in_2019.org][A brief history of Western Philosophy by Anthony Kenny in 2019]]
* [[file:From_computation_to_consciousness_by_Joscha_Bach_in_2014.org][From computation to consciousness by Joscha Bach in 2014]]
* [[file:Philosophical_perspectives_by_Max_Scheler_in_1929.org][Philosophical perspectives by Max Scheler in 1929]]
