content/posts/Husserlian_phenomenology.md
+++
title = "Husserlian phenomenology"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:34:43-04:00
slug = "Husserlian_phenomenology"
draft = false
+++

## conceptual sketch {#conceptual-sketch}


### subjects perceive phenomena, which they turn into noema {#subjects-perceive-phenomena-which-they-turn-into-noema}


### noema:: concepts or mental representations of phenomena {#noema-concepts-or-mental-representations-of-phenomena}


### noesis:: phenomena --> noema {#noesis-phenomena-noema}

<!--list-separator-->

-  noesis is a function that maps phenomena to noema


### when we attempt to apply noesis to noesis recursively, we get noema again and end up resolving this with a need to presuppose the existence of a subject {#when-we-attempt-to-apply-noesis-to-noesis-recursively-we-get-noema-again-and-end-up-resolving-this-with-a-need-to-presuppose-the-existence-of-a-subject}

<!--list-separator-->

-  see the reference to The Phenomenological Reduction of Science by Max Scheler in 1929


## [A brief history of Western Philosophy by Anthony Kenny in 2019]({{< relref "A_brief_history_of_Western_Philosophy_by_Anthony_Kenny_in_2019" >}}) {#a-brief-history-of-western-philosophy-by-anthony-kenny-in-2019--a-brief-history-of-western-philosophy-by-anthony-kenny-in-2019-dot-md}


## [From computation to consciousness by Joscha Bach in 2014]({{< relref "From_computation_to_consciousness_by_Joscha_Bach_in_2014" >}}) {#from-computation-to-consciousness-by-joscha-bach-in-2014--from-computation-to-consciousness-by-joscha-bach-in-2014-dot-md}


## [Philosophical perspectives by Max Scheler in 1929]({{< relref "Philosophical_perspectives_by_Max_Scheler_in_1929" >}}) {#philosophical-perspectives-by-max-scheler-in-1929--philosophical-perspectives-by-max-scheler-in-1929-dot-md}
